#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

aws_vpc.module2-vpc: Refreshing state... [id=vpc-0df74001aabb6f923]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_vpc.module2-vpc will be destroyed
  # (because aws_vpc.module2-vpc is not in configuration)
  - resource "aws_vpc" "module2-vpc" {
      - arn                                  = "arn:aws:ec2:eu-north-1:392029953767:vpc/vpc-0df74001aabb6f923" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0d0159bf67bbe0505" -> null
      - default_route_table_id               = "rtb-01104654f7b715821" -> null
      - default_security_group_id            = "sg-02d54690c6cf5b417" -> null
      - dhcp_options_id                      = "dopt-669f330f" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0df74001aabb6f923" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-01104654f7b715821" -> null
      - owner_id                             = "392029953767" -> null
      - tags                                 = {
          - "Name" = "joensindholt-iac-vpc-main"
        } -> null
      - tags_all                             = {
          - "Name" = "joensindholt-iac-vpc-main"
        } -> null
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "joensindholt-iac-vpc-module-2-main"
        }
      + tags_all                             = {
          + "Name" = "joensindholt-iac-vpc-module-2-main"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>